In [1]:
import pandas as pd

# Series

In [2]:
data = [1, 2, 3, 4, 5, 6, 7]

In [3]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [4]:
index = ["Linea" + str(i) for i in range(7)]
index

['Linea0', 'Linea1', 'Linea2', 'Linea3', 'Linea4', 'Linea5', 'Linea6']

In [5]:
s = pd.Series(data= data, index = index)
s

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
Linea5    6
Linea6    7
dtype: int64

In [6]:
data = {"Linea" + str(i) : i +1 for i in range(7)}
data

{'Linea0': 1,
 'Linea1': 2,
 'Linea2': 3,
 'Linea3': 4,
 'Linea4': 5,
 'Linea5': 6,
 'Linea6': 7}

In [7]:
s = pd.Series(data)
s

Linea0    1
Linea1    2
Linea2    3
Linea3    4
Linea4    5
Linea5    6
Linea6    7
dtype: int64

In [8]:
s1 = s + 2
s1

Linea0    3
Linea1    4
Linea2    5
Linea3    6
Linea4    7
Linea5    8
Linea6    9
dtype: int64

In [9]:
s2 = s1 + s
s2

Linea0     4
Linea1     6
Linea2     8
Linea3    10
Linea4    12
Linea5    14
Linea6    16
dtype: int64

# DataFrame

In [10]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [11]:
df1 = pd.DataFrame(data = data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
index = ["Linea"+ str(i) for i in range(3)]
index

['Linea0', 'Linea1', 'Linea2']

In [13]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linea0  1  2  3
Linea1  4  5  6
Linea2  7  8  9

In [14]:
columns = ["columna"+ str(i) for i in range(3)]
columns

['columna0', 'columna1', 'columna2']

In [15]:
df1 = pd.DataFrame(data = data, index = index, columns= columns)
df1

        columna0  columna1  columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [16]:
data ={"columna0":{"Linea0": 1, "Linea1": 4, "Linea2": 7},
  "columna1":{"Linea0": 2, "Linea1": 5, "Linea2": 8},
  "columna2":{"Linea0":3, "Linea1": 6, "Linea2": 9}}
data

{'columna0': {'Linea0': 1, 'Linea1': 4, 'Linea2': 7},
 'columna1': {'Linea0': 2, 'Linea1': 5, 'Linea2': 8},
 'columna2': {'Linea0': 3, 'Linea1': 6, 'Linea2': 9}}

In [17]:
df2 = pd.DataFrame(data)
df2

        columna0  columna1  columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [18]:
data = [(1,2,3), (4, 5, 6),(7, 8, 9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [19]:
df3 = pd.DataFrame(data, index= index, columns=columns)
df3

        columna0  columna1  columna2
Linea0         1         2         3
Linea1         4         5         6
Linea2         7         8         9

In [20]:
df1[df1>0]="A"
df1

/tmp/ipykernel_4674/1762256164.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'A' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df1[df1>0]="A"

       columna0 columna1 columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A

In [21]:
df2[df2>0]="B"
df2

/tmp/ipykernel_4674/484764680.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'B' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df2[df2>0]="B"

       columna0 columna1 columna2
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B

In [22]:
df3[df3>0]="C"
df3

/tmp/ipykernel_4674/3473117151.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'C' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df3[df3>0]="C"

       columna0 columna1 columna2
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [23]:
df4 = pd.concat([df1, df2, df3])
df4

       columna0 columna1 columna2
Linea0        A        A        A
Linea1        A        A        A
Linea2        A        A        A
Linea0        B        B        B
Linea1        B        B        B
Linea2        B        B        B
Linea0        C        C        C
Linea1        C        C        C
Linea2        C        C        C

In [24]:
df5 = pd.concat([df1, df2, df3], axis=1)
df5

,columna0,columna1,columna2,columna0,columna1,columna2,columna0,columna1,columna2
Linea0,A,A,A,B,B,B,C,C,C
Linea1,A,A,A,B,B,B,C,C,C
Linea2,A,A,A,B,B,B,C,C,C

# Reporte de Análisis III

## inmuebles Residenciales

In [25]:
import pandas as pd

In [26]:
datos = pd.read_csv("Pandas/data/alquiler.csv", sep = ";")
datos.head(10)

,Tipo,Distrito,Cuartos,Vacantes,Suites,Area,Valor,Mantenimiento,Impuesto
0,Habitación,San Borja,1,0,0,40,1700.0,500.0,60.0
1,Casa,Lurigancho,2,0,1,100,7000.0,NaN,NaN
2,Local comercial,Ate,0,4,0,150,5200.0,4020.0,1111.0
3,Departamento,Pachacámac,1,0,0,15,800.0,390.0,20.0
4,Departamento,Ate,1,0,0,48,800.0,230.0,NaN
5,Departamento,Barranco,3,1,0,70,1200.0,NaN,NaN
6,Departamento,Comas,2,0,0,50,1300.0,301.0,17.0
7,Casa en condominio,Ate,5,4,5,750,22000.0,NaN,NaN
8,Casa en condominio,El Agustino,2,2,0,65,1000.0,NaN,NaN
9,Local comercial,Pachacámac,0,3,0,695,35000.0,19193.0,3030.0

In [27]:
list(datos["Tipo"].drop_duplicates())

['Habitación',
 'Casa',
 'Local comercial',
 'Departamento',
 'Casa en condominio',
 'Edificio completo',
 'Flat',
 'Tienda/Salón',
 'Almacén',
 'Casa comercial',
 'Casa de villa',
 'Terreno',
 'Cochera',
 'Loft',
 'Tienda en Centro Comercial',
 'Chacra',
 'Terreno em condominio',
 'Oficina',
 'Chalet',
 'Studio',
 'Hotel',
 'Local industrial']

In [28]:
residencial = ['Habitación',
 'Casa',
 'Departamento',
 'Casa en condominio',
 'Almacén',
 'Casa comercial',
 'Casa de villa'
]
residencial

['Habitación',
 'Casa',
 'Departamento',
 'Casa en condominio',
 'Almacén',
 'Casa comercial',
 'Casa de villa']

In [29]:
datos.head(10)

,Tipo,Distrito,Cuartos,Vacantes,Suites,Area,Valor,Mantenimiento,Impuesto
0,Habitación,San Borja,1,0,0,40,1700.0,500.0,60.0
1,Casa,Lurigancho,2,0,1,100,7000.0,NaN,NaN
2,Local comercial,Ate,0,4,0,150,5200.0,4020.0,1111.0
3,Departamento,Pachacámac,1,0,0,15,800.0,390.0,20.0
4,Departamento,Ate,1,0,0,48,800.0,230.0,NaN
5,Departamento,Barranco,3,1,0,70,1200.0,NaN,NaN
6,Departamento,Comas,2,0,0,50,1300.0,301.0,17.0
7,Casa en condominio,Ate,5,4,5,750,22000.0,NaN,NaN
8,Casa en condominio,El Agustino,2,2,0,65,1000.0,NaN,NaN
9,Local comercial,Pachacámac,0,3,0,695,35000.0,19193.0,3030.0

In [30]:
seleccion = datos["Tipo"].isin(residencial)
seleccion

0         True
1         True
2        False
3         True
4         True
         ...
32955     True
32956     True
32957     True
32958     True
32959    False
Name: Tipo, Length: 32960, dtype: bool

In [31]:
datos_residencial = datos[seleccion]
datos_residencial

,Tipo,Distrito,Cuartos,Vacantes,Suites,Area,Valor,Mantenimiento,Impuesto
0,Habitación,San Borja,1,0,0,40,1700.0,500.0,60.0
1,Casa,Lurigancho,2,0,1,100,7000.0,NaN,NaN
3,Departamento,Pachacámac,1,0,0,15,800.0,390.0,20.0
4,Departamento,Ate,1,0,0,48,800.0,230.0,NaN
5,Departamento,Barranco,3,1,0,70,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
32953,Departamento,Santa Anita,2,0,0,70,900.0,490.0,48.0
32955,Habitación,Pachacámac,0,0,0,27,800.0,350.0,25.0
32956,Departamento,Lince,3,1,2,78,1800.0,800.0,40.0
32957,Departamento,Rímac,2,1,0,48,1400.0,509.0,37.0
32958,Departamento,Rímac,2,0,0,70,3000.0,760.0,NaN

In [32]:
list(datos_residencial["Tipo"].drop_duplicates())

['Habitación',
 'Casa',
 'Departamento',
 'Casa en condominio',
 'Almacén',
 'Casa comercial',
 'Casa de villa']

In [33]:
datos_residencial.shape[0]

23468

In [34]:
datos.shape[0]

32960

In [35]:
datos_residencial.index = range(datos_residencial.shape[0])
datos_residencial

,Tipo,Distrito,Cuartos,Vacantes,Suites,Area,Valor,Mantenimiento,Impuesto
0,Habitación,San Borja,1,0,0,40,1700.0,500.0,60.0
1,Casa,Lurigancho,2,0,1,100,7000.0,NaN,NaN
2,Departamento,Pachacámac,1,0,0,15,800.0,390.0,20.0
3,Departamento,Ate,1,0,0,48,800.0,230.0,NaN
4,Departamento,Barranco,3,1,0,70,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
23463,Departamento,Santa Anita,2,0,0,70,900.0,490.0,48.0
23464,Habitación,Pachacámac,0,0,0,27,800.0,350.0,25.0
23465,Departamento,Lince,3,1,2,78,1800.0,800.0,40.0
23466,Departamento,Rímac,2,1,0,48,1400.0,509.0,37.0
23467,Departamento,Rímac,2,0,0,70,3000.0,760.0,NaN

# Exportando la Base de Datos

In [36]:
datos_residencial.to_csv("Pandas/data/alquiler_residencial.csv", sep = ";")

In [37]:
datos_residencial_2 = pd.read_csv("Pandas/data/alquiler_residencial.csv", sep = ";")
datos_residencial_2

,Unnamed: 0,Tipo,Distrito,Cuartos,Vacantes,Suites,Area,Valor,Mantenimiento,Impuesto
0,0,Habitación,San Borja,1,0,0,40,1700.0,500.0,60.0
1,1,Casa,Lurigancho,2,0,1,100,7000.0,NaN,NaN
2,2,Departamento,Pachacámac,1,0,0,15,800.0,390.0,20.0
3,3,Departamento,Ate,1,0,0,48,800.0,230.0,NaN
4,4,Departamento,Barranco,3,1,0,70,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
23463,23463,Departamento,Santa Anita,2,0,0,70,900.0,490.0,48.0
23464,23464,Habitación,Pachacámac,0,0,0,27,800.0,350.0,25.0
23465,23465,Departamento,Lince,3,1,2,78,1800.0,800.0,40.0
23466,23466,Departamento,Rímac,2,1,0,48,1400.0,509.0,37.0
23467,23467,Departamento,Rímac,2,0,0,70,3000.0,760.0,NaN

In [38]:
datos_residencial.head(10)

,Tipo,Distrito,Cuartos,Vacantes,Suites,Area,Valor,Mantenimiento,Impuesto
0,Habitación,San Borja,1,0,0,40,1700.0,500.0,60.0
1,Casa,Lurigancho,2,0,1,100,7000.0,NaN,NaN
2,Departamento,Pachacámac,1,0,0,15,800.0,390.0,20.0
3,Departamento,Ate,1,0,0,48,800.0,230.0,NaN
4,Departamento,Barranco,3,1,0,70,1200.0,NaN,NaN
5,Departamento,Comas,2,0,0,50,1300.0,301.0,17.0
6,Casa en condominio,Ate,5,4,5,750,22000.0,NaN,NaN
7,Casa en condominio,El Agustino,2,2,0,65,1000.0,NaN,NaN
8,Departamento,Pachacámac,1,0,0,36,1200.0,NaN,NaN
9,Departamento,Mi Perú,2,1,0,70,1500.0,642.0,74.0

In [39]:
datos_residencial.to_csv("Pandas/data/alquiler_residencial.csv", sep = ";", index = False)

In [40]:
datos_residencial_2 = pd.read_csv("Pandas/data/alquiler_residencial.csv", sep = ";")
datos_residencial_2

,Tipo,Distrito,Cuartos,Vacantes,Suites,Area,Valor,Mantenimiento,Impuesto
0,Habitación,San Borja,1,0,0,40,1700.0,500.0,60.0
1,Casa,Lurigancho,2,0,1,100,7000.0,NaN,NaN
2,Departamento,Pachacámac,1,0,0,15,800.0,390.0,20.0
3,Departamento,Ate,1,0,0,48,800.0,230.0,NaN
4,Departamento,Barranco,3,1,0,70,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
23463,Departamento,Santa Anita,2,0,0,70,900.0,490.0,48.0
23464,Habitación,Pachacámac,0,0,0,27,800.0,350.0,25.0
23465,Departamento,Lince,3,1,2,78,1800.0,800.0,40.0
23466,Departamento,Rímac,2,1,0,48,1400.0,509.0,37.0
23467,Departamento,Rímac,2,0,0,70,3000.0,760.0,NaN